# import pandas as pd

# villags = [1309890, 1409890, 1992800, 2018281, 1348115, 1380391, 1039278, 1043681, 1052746, 1052877]

# form = [	
# ("Гомель", 2018),
# ("Гомель", 2019),
# ("Минск", 2018), 
# ("Минск", 2019), 
# ("Брест", 2018),
# ("Брест", 2019),
# ("Гродно", 2018),
# ("Гродно", 2019), 
# ("Могилев", 2018),
# ("Могилев", 2019)]

# FrameMI = pd.MultiIndex.from_tuples(form, names =["Город", "Год"])

# s = pd.Series(villags, index=form)

# print(s)

import pandas as pd

form = [	
			["Гомель", 2018, 1309890],
			["", 2019, 1409890],
			["Минск", 2018, 1992800], 
			["", 2019, 2018281], 
			["Брест", 2018, 1348115],
			["", 2019, 1380391],
			["Гродно", 2018, 1039278],
			["", 2019, 1043681], 
			["Могилев", 2018, 1052746],
			["", 2019, 1052877]
		]

FrameMI = pd.DataFrame(form)

s = pd.Series(index=form)

print(s)